read_json riscv_alu_rtl.json
techmap -map /home/ben/repo/verilog2factorio/techmap/v2f_narrowing.v;;
techmap -map /home/ben/repo/verilog2factorio/techmap/v2f_techmap.v;;
techmap -dont_map $adff -dont_map $adffe -dont_map $dff -dont_map $dffe -dont_map $sdff -dont_map $sdffe
techmap -map /home/ben/repo/verilog2factorio/yosys/techlibs/common/gate2lut.v -D LUT_WIDTH 12
clean; opt_lut
flowmap -maxlut 12
opt -fast
abc -fast
abc -fast -lut 12
opt -fast
opt_lut
opt_clean
select riscv_alu
write_json -selected riscv_alu_rtl_map.json